tap "alienator88/cask"
tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "arrow2nd/tap"
tap "charmbracelet/tap"
tap "cutbox/cutbox"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "modularml/packages"
tap "tk04/tap"
# Run your GitHub Actions locally
brew "act"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# General-purpose data compression with high compression ratio
brew "xz"
# Download with resuming and segmented downloading
brew "aria2"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Cross-platform lib for process and system monitoring in Python
brew "python-psutil"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Bash shell debugger
brew "bashdb"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Terminal multiplexer
brew "tmux"
# Text-based window manager and terminal multiplexer
brew "byobu"
# GNU Emacs text editor
brew "emacs"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Emacs dependency management
brew "cask"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Command-line csv viewer
brew "csvlens"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Zip password cracker
brew "fcrackzip"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Text mode browser and Gemini, NNTP, FTP, Gopher, Finger, and BitTorrent client
brew "felinks"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Cat alternative written in Go
brew "gat"
# R7RS Scheme implementation, developed to be a handy script interpreter
brew "gauche"
# GNOME text editor
brew "gedit"
# Nonsense activity generator
brew "genact"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Update multiple git repositories at once
brew "gitup", link: false
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# GNU troff text-formatting system
brew "groff"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake", link: false
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Interactive computing in Python
brew "ipython"
# Git-compatible distributed version control system
brew "jj"
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Selection-based modal text editor
brew "kakoune"
# LaTeX-to-HTML translator
brew "latex2html"
# Translate LaTeX to RTF
brew "latex2rtf"
# Compare and mark up LaTeX file differences
brew "latexdiff"
# Common error values for all GnuPG components
brew "libgpg-error"
# SIXEL encoder/decoder implementation
brew "libsixel"
# Next-gen compiler infrastructure
brew "llvm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Text-based web browser
brew "lynx"
# Apple Silicon Monitor Top written in Golang
brew "mactop"
# Platform built on V8 to build network applications
brew "node"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Mac App Store command-line interface
brew "mas"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Zero-dependency real-time media server and media proxy
brew "mediamtx"
# Small build system for use with gyp or CMake
brew "ninja"
# Modern and intuitive terminal-based text editor
brew "micro"
# Terminal-based visual file manager
brew "midnight-commander"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Mac command-line tool that automatically downloads macOS Firmwares / Installers
brew "mist-cli"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Node.js version manager
brew "nodebrew"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# CLI for the Pkl programming language
brew "pkl"
# Modern replacement for ps written by Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Password generator
brew "pwgen"
# Python bindings for the Brotli compression library
brew "python-brotli"
# Python module for handling audio metadata
brew "python-mutagen"
# Pretty-print tabular data in Python
brew "python-tabulate"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Cross-platform application and UI framework
brew "qt"
# Software environment for statistical computing
brew "r"
# File browser
brew "ranger"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust", link: false
# JVM-based programming language
brew "scala"
# Web crawling & scraping framework
brew "scrapy"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Prometheus SLO generator
brew "sloth", link: false
# Version control system designed to be a better CVS
brew "subversion"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Feature-rich console based todo list manager
brew "task"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Lightweight BitTorrent client
brew "transmission-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Markup-based typesetting system
brew "typst"
# Command-line tool for Vapor (Server-side Swift web framework)
brew "vapor"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Userspace Go implementation of WireGuard
brew "wireguard-go"
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodes", link: false
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Suite of barcodes-reading tools
brew "zbar"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# CLI tool to rename trashy file names
brew "arrow2nd/tap/gomi-rename"
# Generate images of code and terminal output.
brew "charmbracelet/tap/freeze"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Modular developer CLI tool
brew "modularml/packages/modular"
# Stand alone ad blocker
cask "adguard"
# VPN for privacy and security
cask "adguard-vpn"
# Note editor and whiteboard
cask "affine"
# Photo storage and sharing service
cask "amazon-photos"
# AI-powered productivity tool for the command-line
cask "amazon-q"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Tools for building Android applications
cask "android-studio"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# Open-source project and knowledge management tool
cask "appflowy"
# User-friendly GUI app for Homebrew
cask "applite"
cask "aquaskk"
# Chromium based browser
cask "arc"
# Tool for digging into binary files
cask "archaeology"
# Asciidoc editor and toolchain to build books, documents and slides
cask "asciidocfx"
# Multi-track audio editor and recorder
cask "audacity"
# Audio player inspired by Winamp
cask "aural"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# App for managing battery charging. (Also installs a CLI on first use.)
cask "battery"
# Replacement of the default battery indicator in the menu bar
cask "battery-buddy"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Edit and manage bibliographies
cask "bibdesk"
# Record and process your ideas
cask "bike"
# Virtual Audio Driver
cask "blackhole-2ch"
# 3D creation suite
cask "blender"
# CD burning application
cask "burn"
# Design tool
cask "canva"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Code editor
cask "codeedit"
# Multi-language programming editor
cask "coderunner"
# Terminal emulator mimicking the old cathode display
cask "cool-retro-term"
# Xcode extension for GitHub Copilot
cask "copilot-for-xcode"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Tool to run Windows software
cask "crossover"
# UI for creating Windows installer ISO from UUPDump
cask "crystalfetch"
# Server and cloud storage browser
cask "cyberduck"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Database manager for MySQL, PostgreSQL, SQL Server, MongoDB, SQLite and others
cask "dbgate"
# IDE for building React Native applications
cask "deco"
# Trains AIs to understand and translate texts
cask "deepl"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Run Stable Diffusion locally
cask "diffusionbee"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Share your work and ideas with video messages and screenshots
cask "dropbox-capture"
# Web browser focusing on privacy
cask "duckduckgo"
# Outlining app for your work
cask "dynalist"
# Find files, folders, or contents in any file
cask "easyfind"
# Text editor
cask "emacs"
# Launcher for *Epic Games* games
cask "epic-games"
# Status monitoring
cask "eul"
# Collaborative team software
cask "figma"
# Network scanner
cask "fing"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-0xproto-nerd-font"
cask "font-cascadia-mono-nf"
cask "font-hannari"
cask "font-jetbrains-mono-nerd-font"
cask "font-kiwi-maru"
cask "font-plemol-jp-nf"
cask "font-source-code-pro"
cask "font-yusei-magic"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# Git client focusing on productivity
cask "gitkraken"
# Git interface focused on visual interaction
cask "gitup"
# Game development engine
cask "godot"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-beta"
# Client for the Google Drive storage service
cask "google-drive"
# Virtual globe
cask "google-earth-pro"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Open Source Multimedia Framework
cask "gstreamer-framework"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Open-source video transcoder
cask "handbrake"
# Terminal built on web technologies
cask "hyper"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Hex editor for reverse engineers
cask "imhex"
# Vector graphics editor
cask "inkscape"
# Menu bar calendar
cask "itsycal"
# Offline AI chat tool
cask "jan"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Find shortcuts for any installed application
cask "keyclu"
# Open source code editor written in Rust
cask "lapce"
# NDI SDK
cask "libndi"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Support for Logitech G gear
cask "logitech-g-hub"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# File system integration
cask "macfuse"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Speech recognition tool
cask "macwhisper"
# Desktop App for Easily Viewing and Editing Markdown Files
cask "marker"
# Extensible two-pane file manager
cask "marta"
# Code snippets manager for developers
cask "masscode"
# Text editor
cask "mi"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Open-source DJ software
cask "mixxx"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk-for-visual-studio"
# Open-source download manager
cask "motrix"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Open-source music notation software
cask "musescore"
# Multi-file renaming tool
cask "name-mangler"
# Free and open-source RSS reader
cask "netnewswire"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Automated scene switcher for OBS Studio
cask "obs-advanced-scene-switcher"
# iOS camera plugin for OBS Studio
cask "obs-ios-camera-source"
# NDI integration for OBS Studio
cask "obs-ndi"
# Remote-control OBS Studio through WebSockets
cask "obs-websocket"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Securely and anonymously share files, host websites, and chat with friends
cask "onionshare"
# System and utility switches
cask "only-switch"
# Document editor
cask "onlyoffice"
# Web browser
cask "opera"
# Replacement for Docker Desktop
cask "orbstack"
# Mimic the aesthetic of ray-oscilloscopes
cask "oscilloscope"
# Used to access context-specific actions when text is selected
cask "popclip"
# Collaborative SQL editor
cask "popsql"
# Command-line shell and scripting language
cask "powershell"
# HTTP debugging proxy
cask "proxyman"
# Text editor
cask "pulsar"
# Sound, video and lighting control
cask "qlab"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# Window snapping tool
cask "rectangle-pro"
# Spaced-repetition powered note-taking tool
cask "remnote"
# Data science software focusing on R and Python
cask "rstudio"
# Rust IDE
cask "rustrover"
# Screen saver for custom video files
cask "save-hollywood"
# Notepad software
cask "scapple"
# Word processing software with a typewriter style
cask "scrivener"
# Utility to control Gatekeeper via a GUI
cask "sentinel-app"
# MySQL/MariaDB database management
cask "sequel-ace"
# Screenshot measurement and annotation tool
cask "shottr"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Notepad with a built-in calculator
cask "soulver"
# Open source cross-platform file explorer
cask "spacedrive"
# Scientific Python IDE
cask "spyder"
cask "sqlectron"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# Interior design application
cask "sweet-home3d"
# Customizable email client
cask "thunderbird"
# Menu bar app to show Time Machine information
cask "timemachinestatus"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Virtualization tool
cask "virtualbuddy"
# Integrated development environment
cask "visual-studio"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi-snapshot"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Wine wrapper built with SwiftUI
cask "whisky"
# Compatibility layer to run Windows applications
cask "wine-crossover"
# WordPress client
cask "wordpresscom"
# WordPress local development environment
cask "wordpresscom-studio"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# Driver and configuration app for XP-Pen graphic tablets
cask "xppen-pentablet"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Multiplayer code editor
cask "zed"
# Open-source markdown editor
cask "zettlr"
# Video communication and virtual meeting platform
cask "zoom"
mas "Actions", id: 1586435171
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Amphetamine", id: 937984704
mas "Baking Soda", id: 1601151613
mas "Blackmagic RAW Player", id: 1435415804
mas "Blackmagic RAW Speed Test", id: 1466185689
mas "Bluebird", id: 1478757472
mas "Boop", id: 1518425043
mas "ByeGraph", id: 6467188044
mas "Capo", id: 696977615
mas "Codelime", id: 1622145140
mas "Codye", id: 1516894961
mas "Collections", id: 1568395334
mas "Color Picker", id: 1545870783
mas "com.jeremyvizzini.screentolayers.osx", id: 1077317077
mas "Command X", id: 6448461551
mas "Compressor", id: 424390742
mas "Craft", id: 1487937127
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Drafts", id: 1435957248
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Eagle for Safari", id: 1526651672
mas "egword Universal 2", id: 1272842196
mas "Enchanted", id: 6474268307
mas "Encrypto", id: 935235287
mas "Expenses", id: 1492055171
mas "Final Cut Pro", id: 424389933
mas "FirstSeed Calendar", id: 1348617240
mas "FirstSeed Tasks", id: 1627018604
mas "Gemini 2", id: 1090488118
mas "GeoGebra Classic 6", id: 1182481622
mas "Gifski", id: 1351639930
mas "Goodnotes", id: 1444383602
mas "GoT: Tale of Crows", id: 1483071787
mas "Habit Tracker", id: 6466580414
mas "Helm", id: 1099472017
mas "HextEdit", id: 1557247094
mas "Hush", id: 1544743900
mas "Hyperduck", id: 6444667067
mas "iA Writer", id: 775737590
mas "Just Press Record", id: 1033342465
mas "JuxtaText", id: 6504801865
mas "Keepa - Price Tracker", id: 1533805339
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LadioCast", id: 411213048
mas "LanguageTranslator", id: 1218781096
mas "LINE", id: 539883307
mas "Logic Pro", id: 634148309
mas "MachineProfile", id: 530194517
mas "Mactracker", id: 430255202
mas "MainStage", id: 634159523
mas "MarkMark", id: 6475077023
mas "Memento", id: 1200227397
mas "Microsoft Remote Desktop", id: 1295203466
mas "Mini Metro+", id: 1550663539
mas "Mini Motorways", id: 1456188526
mas "Momentum", id: 1564329434
mas "Money Pro", id: 972572731
mas "Motion", id: 434290957
mas "Multi Page Print", id: 6443749435
mas "Numbers", id: 409203825
mas "Online Check", id: 6504709660
mas "Pages", id: 409201541
mas "Pastel", id: 413897608
mas "Patterns", id: 429449079
mas "People翻訳", id: 6451377502
mas "Photomator", id: 1444636541
mas "Physics 101", id: 435293897
mas "Physics Latex Editor", id: 6453889446
mas "Piccolo", id: 1561230039
mas "Pixave", id: 924891282
mas "Pixelmator Pro", id: 1289583905
mas "Playgrounds", id: 1496833156
mas "Plot2", id: 846509360
mas "Poolsuite FM", id: 1514817810
mas "Prime Video", id: 545519333
mas "QuickFTP", id: 1451646819
mas "QuickLinks", id: 1200685619
mas "QuickMIDI", id: 1459790045
mas "School", id: 1465687472
mas "Secrets", id: 1591056366
mas "Shareful", id: 1522267256
mas "Snap Converter", id: 431094796
mas "sort.photos: AI Photo and PDF Renamer", id: 6480457357
mas "Spark Desktop", id: 6445813049
mas "stone", id: 1230288277
mas "Structured", id: 1499198946
mas "Telegram", id: 747648890
mas "Teleprompter", id: 6463623914
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
mas "TimeDeposit", id: 6445899149
mas "Transport Fever 2", id: 1537063060
mas "Trello", id: 1278508951
mas "Twitter", id: 1482454543
mas "Upsies", id: 6475957299
mas "URL Linker", id: 1289119450
mas "Usage", id: 1561788435
mas "Velja", id: 1607635845
mas "Vinegar", id: 1591303229
mas "VirusBarrier Scanner", id: 1200445649
mas "waifu2x", id: 1286485858
mas "Wavebar", id: 6450398808
mas "WiFi Signal Strength Explorer", id: 1177934624
mas "WorldWideWeb", id: 1621370168
mas "Yoink", id: 457622435
mas "ちゃちゃっとリネーマー", id: 6462363612
mas "六法", id: 1272669652
mas "辞書 by 物書堂", id: 1380563956
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "cweijan.vscode-office"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "eamodio.gitlens"
vscode "eliverlara.andromeda"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ibm.output-colorizer"
vscode "janisdd.vscode-edit-csv"
vscode "jrebocho.vscode-random"
vscode "marp-team.marp-vscode"
vscode "mathematic.vscode-latex"
vscode "modular-mojotools.vscode-mojo"
vscode "mohammadbaqer.better-folding"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.mono-debug"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sswg.swift-lang"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vknabel.vscode-apple-swift-format"
vscode "vknabel.vscode-swiftformat"
vscode "zhuangtongfa.material-theme"
